в(каньйон, прірва).
синоніми(прірва, [ущелина]).
опис(прірва, "У прірві праворуч дзюрчить Чоргун.").

в(прірва, річка). відкрито(прірва).
синоніми(річка, [ріка, річка, 'Чоргун', 'Чорна ріка', 'Чорна річка', 'Казикли-Озен']). 
опис(річка, "Метрів зо двадцять внизу видно гірський потік.").

в(каньйон, стежка).
синоніми(стежка, [стежина, земля, манівець, оманець, тропа, плай, плая, хідник, хідничка, ходник, троповик, тропок, стежа, стезя, протопт, протопти]).
опис(стежка, "Понад прірвою, вʼється вузька стежка.").
%
стежка(стежка).

в(каньйон, патичок).
синоніми(патичок, [патик, дрючок, палка, палиця, дрин, альпеншток, дрючечок]).
опис(патичок, "Валяється сосновий патичок.").
описує(патичок, "Потрібне.").
%
на(стежка, патичок) :- в(каньйон, патичок).
можна(взяти, патичок).
%
після(взяти(патичок)) :- оповідь("Обережно, з металевим і аж наче іржавим скреготом, робот піднімає патичка.").
після(покласти(патичок)) :- оповідь("Обережно, робот лишає патичка.").

в(каньйон, небо). високо(небо). відкрито(небо).

в(небо, орел). в(каньйон, орел).
синоніми(орел, [птиця, птаха, пташка, птах, хижак]).
відмінок(знахідний, орел, орла).
опис(орел, "Високо в небі літа орел.").
високо(орел).

в(каньйон, скелі).
в(каньйон, дерева). синоніми(дерева, [сосни, деревця]).


іти(стежка) :-
    має(патичок),
    абзац("Зі скреготом, робот-відпочивальник рушає. Він сіпає правою ногою, а намагається балансувати за допомогою патичка."),
    абзац("Незграбно перечепившися об камінь, робот втрачає рівновагу і завалюється геть в ущелину. Падаючи, він жалісно лязкає і намагається зарубитися альпештоком об вологі скелі, та марно."),
    абзац("ЗВʼЯЗОК ВТРАЧЕНО."), nl,
    кінець_гри.
іти(стежка) :-
    \+ має(патичок),
    абзац("Зі скреготом, робот-відпочивальник рушає. Він сіпає правою ногою і час від часу поглядає у прірву праворуч."),
    абзац("На невеликому підйомі, права нога робота проковзує. Він намагається втримати рівновагу, та його права рука клинить. З гуркотом і жалісними посвистами по кожному з ударів, робот падає у прірву."),
    абзац("ЗВʼЯЗОК ВТРАЧЕНО."), nl,
    кінець_гри.

гра :-
    абзац, оповідь(розділ, "Розділ I—Гарячі чебуреки"), абзац,
    оповідь(чоловік, "Не те щоб телепутівка мене аж надто радувала, але все ж вона дісталася безплатно, і цього вечора я збиравсь отримати від неї якнайбільше. Для настрою, я замовив синтетичних креветок і два чебуреки; зручненько собі вмостившися в кріслі перед телетайпом, я подав команду на зʼєднання з роботом-відпочивальником."),
    абзац("Вас вітає «ТелеАп!». Дякуємо, що вирішили скористатися нашими послугами."),
    абзац("ПОШУК ВІЛЬНОГО РОБОТА ТЕЛЕПРИСУТНОСТІ… #443 Володя ПРИЙМАЄ ВАШ ЗАПИТ. ВСТАНОВЛЮЄМО ЗВʼЯЗОК… Є."),
    абзац("Приємного відпочинку!"),    
    абзац("---"),
    зайти_на_сцену(каньйон),
    repl.

заходить(каньйон) :-
    оповідь(чоловік, "Тут я вже зрозумів: щось не те. Навряд же в листопаді всі відпочивальники на пляжах Південного берегу забиті, а я ж спеціально вказав, куди я хочу. Мабуть, треба було одразу подзвонити диспетчеру; та я полінивсь і заходився друкувати.").

називається(герой, '#443 Володя').
