% Завантажується _перед_ .qlf-модулем і переозначує потрібні предикати
% --------------------------------------------------------------------

:- multifile зчитати_рядок/1, пустий_рядок/0, написати_втупу/2,
	     abort/0.

зчитати_рядок(Стр) :- !,
	% Чекати на введення
	Promise := promise_read_input, await(Promise, Стр).

пустий_рядок :- !,
	flush_output, % Заставити SWIPL вилити буфер виводу
	_ := new_paragraph().
% TODO: після Enter, виводиться абзац -> пустий рядок який залишається висіти


написати_втупу(розділ, Щось) :- !,
	flush_output,
	atom_string(Щось, Стр),
	_ := console.log(Стр),
	_ := chapter(Стр).
написати_втупу(вдома, Щось) :- !,
	flush_output,
	atom_string(Щось, Стр),
	_ := console.log(Стр),
	_ := continue_styled("athome", Стр).

abort :- !, оповідь("Не підтримується у веб-версії.").
